// let stu = +prompt("Студенттер санын енгізіңіз")
// let sany = 1;
// let total_baga = 0;
// while(sany <= stu){
//     let baga = +prompt( sany + "-студенттің бағасын енгізіңіз:")
//     total_baga=total_baga+baga
//     sany++;
// }
//     let upai = total_baga / stu
//     alert("Студенттердің бағаларының орташа мәні:" + upai)

    


    // Тапсырма:
    //    Берілгендерді енгізіп, бағдарламада бағаларды енгізу арқылы студенттердің орташа бағасын есептейтін код жазыңыз.
    // Қолданушы студенттер санын енгізеді (мысалы: 3).
    // Содан кейін, енгізілген санға сәйкес әр студенттің бағаларын кезекпен енгізеді.
    // Барлық бағалар енгізілгеннен кейін, бағдарлама сол бағалардың орташа мәнін шығарады.
    
    // Мысалы

    //    prompt: 
    //         Студенттер санын енгізіңіз: 3 

    //   prompt:
    //          1-студенттің бағасын енгізіңіз: 85 
    //          2-студенттің бағасын енгізіңіз: 90 
    //          3-студенттің бағасын енгізіңіз: 78 

    //   Нәтижесі:
    //         Студенттердің бағаларының орташа мәні: 84.33


    let student = +prompt("Student sanyn zhazynyz")
    let oqushy = 1;
    let bagalary = 0;
    while(student >= oqushy){
        let baga = +prompt(oqushy+"-Student bagasyn engiziniz" )
        bagalary = bagalary + baga
        oqushy++;

    }
    alert("Студенттердің бағаларының орташа мәні" + bagalary / student)



    