let stu = +prompt("Студенттер санын енгізіңіз")
let sany = 1;
while(sany <= stu){
    let baga = prompt( sany + "-студенттің бағасын енгізіңіз:")
    sany++;
}
    let upai = (sany + baqa) / stu
    alert("Студенттердің бағаларының орташа мәні:" + upai)

    


    // Тапсырма:
    //    Берілгендерді енгізіп, бағдарламада бағаларды енгізу арқылы студенттердің орташа бағасын есептейтін код жазыңыз.
    // Қолданушы студенттер санын енгізеді (мысалы: 3).
    // Содан кейін, енгізілген санға сәйкес әр студенттің бағаларын кезекпен енгізеді.
    // Барлық бағалар енгізілгеннен кейін, бағдарлама сол бағалардың орташа мәнін шығарады.
    
    // Мысалы

    //    prompt: 
    //         Студенттер санын енгізіңіз: 3 

    //   prompt:
    //          1-студенттің бағасын енгізіңіз: 85 
    //          2-студенттің бағасын енгізіңіз: 90 
    //          3-студенттің бағасын енгізіңіз: 78

    //   Нәтижесі:
    //         Студенттердің бағаларының орташа мәні: 84.33