let san = [1, 2, 3, 4, 5]















// 1- Тапсырма:
// Бізде массив берілген. Массивтегі әр санды кубтаңыз(үш дәреже).(map())
// Кубталған сандардың ішінен тек тақ сандарды шығару керек.(for...of)
// 2 - Тапсырма:











//  Студент санын промпт арқылы сұраңыз.
// Әр студенттің бағаларын массив ашып соған салыңыз.
// "reduce" арқылы айнымалы ашып барлық бағаны жинаңыз, және Оқушылардың ортақ бағасын шығарыңыз.
//  (Ортақ баға = Барлық студент бағаларының қосындысы / Студент саны) .
// "filter" арқылы 85тен жоғары баллдарды жинап шығарып беріңіз
// Әдеттегідей Github-қа жүктеп, сілтемесін өткіземіз!
// ЕСКЕРТУ! Үй жұмысын бүгінгі өткен тақырыпты қолдана отырып жасайсыздар!