let soz1 = prompt("Birinshi san zhaz")
let soz2 = prompt("ekinshi san zhaz")

function compareWords(soz1, soz2) {
    if(soz1 == soz2){
        return "sozder birdei"
    }else{
        return "Sozder kelmeidi"
    }
}
alert(compareWords(soz1,soz2))





// Тапсырма Сипаттамасы: 
//    Сізге екі сөз беріледі. Сол сөздердің бірдей екенін немесе бірдей еместігін тексеретін функция жазыңыз. 

// Талаптар: 
// Функцияның аты compareWords болсын. 
// Сөздер бас әріпке тәуелді болмауы керек (case-insensitive).
//  Яғни, мен "Javascript" және  "javascript" деп еңгізсем маған "Сөздер бірдей" деп қайтаруы керек
// Егер сөздер бірдей болса: "Сөздер бірдей". Егер бірдей болмаса: "Сөздер әртүрлі" деп хабарлаңыз.
// Кеңес:
// Сөздердің біреуі кішкентай, 
// екінші үлкен әріппен жазылғанда тексеру үшін toLowerCase() функциясын сөзді кішірейтіп алу үшін қолдансаңыз болады.